#+TITLE: Training the CNN
#+PROPERTY: header-args:ipython :session /home/bvr/tmp/kernel-dp-ssh.json :results output

* Options
#+BEGIN_SRC ipython :noweb-ref functions
  def load_options(options_file) :
    with open(options_file, 'r') as J :
      options = yajl.load(J)

    options = Namespace(**options)
    return options
#+END_SRC

#+RESULTS:

Usage:
#+BEGIN_SRC ipython :noweb-ref function_tests
  options_file = "/home/bvr/code/rivet/sample_options.json"
  options = load_options(options_file)

  lg.info(options)
#+END_SRC

#+RESULTS:
: INFO    : Namespace(distance='euclidean', loss='contrastive', network='resnet18', num_input=2)

* Pytorch Identity Module
#+BEGIN_SRC ipython :noweb-ref imports
  from torch.nn import Module
#+END_SRC

#+BEGIN_SRC ipython :noweb-ref functions
  class Identity(Module) :
    def forward(self, inputs) :
      return inputs


  lg.info(Identity())

#+END_SRC

#+RESULTS:
: INFO    : Identity()


** TODO Test this (Include test for triplet)
<2018-05-27 Sun 13:12>

#+BEGIN_SRC ipython :noweb-ref cd_main
  # To Test
  # -----------------------------------
  # combinations_dataset(similar_pairs, image_list,
  #                      transform = None,
  #                      dissimilar_fn = None)

  # Logging:
  # -----------------------------------
  import logging as lg
  lg.basicConfig(level=lg.INFO, format='%(levelname)-8s: %(message)s')

  # With transforms
  # -----------------------------------
  from torchvision.transforms import Compose, Grayscale, ToTensor
  from torchvision.transforms import Resize, RandomCrop
  T = Compose([Grayscale(), Resize(224), RandomCrop(224), ToTensor()])

  ## Json Loader
  # -----------------------------------
  import yajl

  combinations_json = '/home/bvr/data/pytosine/k_nearest/20180526-153919/combinations.json'
  with open(combinations_json, 'r') as J :
    similar_pairs = yajl.load(J)
  lg.info('Loaded similar pairs: size:%s', len(similar_pairs))

  adjacency = edge_to_adjacency(similar_pairs)
  # TODO: include edge_to_adjacency before tangle

  image_list_json = '/home/bvr/data/pytosine/k_nearest/20180521-205730/image_list.json'
  image_list_key = 'image_list'
  with open(image_list_json, 'r') as J :
    image_list = yajl.load(J)[image_list_key]
  lg.info('Loaded image_list: size:%s', len(image_list))

  def test_dataset(dataset_name) :
    global adjacency, image_list, T

    dataset = dataset_name(
      adjacency, image_list,
      transform = T,
      labels=[np.array([1, 0]), np.array([0, 1])])

    dataloader = DataLoader(
      dataset, shuffle=True, batch_size = 64
    )

    for i, (y, x) in enumerate(dataloader) :
      lg.info('sizes: len(y), y[0].size, len(x), x[0].size: %s, %s, %s, %s',
              len(y), y[0].size(), len(x), x[0].size())


  test_dataset(pairwise_dataset)
  test_dataset(triplet_dataset)
#+END_SRC

#+RESULTS:
#+begin_example
INFO    : Loaded similar pairs: size:108
INFO    : Loaded image_list: size:48512
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
INFO    : sizes: len(y), y[0].size, len(x), x[0].size: 64, torch.Size([2]), 2, torch.Size([64, 1, 224, 224])
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
INFO    : sizes: len(y), y[0].size, len(x), x[0].size: 64, torch.Size([2]), 2, torch.Size([64, 1, 224, 224])
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
INFO    : sizes: len(y), y[0].size, len(x), x[0].size: 64, torch.Size([2]), 2, torch.Size([64, 1, 224, 224])
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
INFO    : sizes: len(y), y[0].size, len(x), x[0].size: 64, torch.Size([2]), 2, torch.Size([64, 1, 224, 224])
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
INFO    : sizes: len(y), y[0].size, len(x), x[0].size: 64, torch.Size([2]), 2, torch.Size([64, 1, 224, 224])
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
INFO    : sizes: len(y), y[0].size, len(x), x[0].size: 4, torch.Size([2]), 2, torch.Size([4, 1, 224, 224])
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
INFO    : sizes: len(y), y[0].size, len(x), x[0].size: 64, torch.Size([2, 2]), 3, torch.Size([64, 1, 224, 224])
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
INFO    : sizes: len(y), y[0].size, len(x), x[0].size: 64, torch.Size([2, 2]), 3, torch.Size([64, 1, 224, 224])
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
INFO    : sizes: len(y), y[0].size, len(x), x[0].size: 64, torch.Size([2, 2]), 3, torch.Size([64, 1, 224, 224])
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
DEBUG   : STREAM b'IHDR' 16 13
DEBUG   : STREAM b'IDAT' 41 8192
INFO    : sizes: len(y), y[0].size, len(x), x[0].size: 24, torch.Size([2, 2]), 3, torch.Size([24, 1, 224, 224])
#+end_example

#+BEGIN_SRC ipython :noweb-ref cd_include
  from functools import reduce
  import operator
#+END_SRC

#+RESULTS:

#+BEGIN_SRC ipython :noweb-ref cd_functions
  def flatten(inp_list) :
    return reduce(operator.concat, inp_list)
#+END_SRC


